system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-18 -10 -10)
    (22 -10 -10)
    (22 10 -10)
    (-18 10 -10)
    (-18 -10 10)
    (22 -10 10)
    (22 10 10)
    (-18 10 10)
);

blocks  
(
    hex ( 0 1 2 3 4 5 6 7)
    (40 20 20)
    simpleGrading (1 1 1)
);

edges  
(
);

patches  
( 
  patch front
  (
      (0 4 7 3)
  ) 
  patch back
  (
      (1 2 6 5)
  ) 
  patch bot
  (
      (0 1 5 4)
  ) 
  patch top
  (
      (3 7 6 2)
  ) 
  patch right
  (
      (0 3 2 1)
  ) 
  patch left
  (
      (4 5 6 7)
  )
);

mergePatchPairs  
(
);
