system/snappyHexMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object snappyHexMeshDict;
}

    prismLayer 6;

    castellatedMesh true;
    snap true;
    addLayers true;
    geometry
    {

        boattailStraight.stl
        {
            type triSurfaceMesh;
            name  boattailStraight;
        }


        bodyTube.stl
        {
            type triSurfaceMesh;
            name  bodyTube;
        }


        finCan.stl
        {
            type triSurfaceMesh;
            name  finCan;
        }


        nosecone.stl
        {
            type triSurfaceMesh;
            name  nosecone;
        }


        nozzle.stl
        {
            type triSurfaceMesh;
            name  nozzle;
        }


    }

    castellatedMeshControls
    {
        features
        (

            {
                file "boattailStraight.eMesh";
                level 8;
            }


            {
                file "bodyTube.eMesh";
                level 8;
            }


            {
                file "finCan.eMesh";
                level 9;
            }


            {
                file "nosecone.eMesh";
                level 8;
            }


            {
                file "nozzle.eMesh";
                level 8;
            }


        );
        refinementSurfaces
        {

            boattailStraight
            {
                level ( 7 7 );
            }


            bodyTube
            {
                level ( 7 7 );
            }


            finCan
            {
                level ( 8 8 );
            }


            nosecone
            {
                level ( 7 7 );
            }


            nozzle
            {
                level ( 7 7 );
            }


        }

        refinementRegions
        {

           
        }

        locationInMesh ( 4.48 0.21 -0.3 );
        maxLocalCells 10000000;
        maxGlobalCells 200000000;
        minRefinementCells 0;
        nCellsBetweenLevels 3;
        resolveFeatureAngle 10;
        allowFreeStandingZoneFaces true;
        planarAngle 30;
        maxLoadUnbalance 0.10;
    }

    snapControls
    {
        nSolveIter 50;
        nSmoothPatch 3;
        tolerance 2.0;
        nRelaxIter 5;
        nFeatureSnapIter 10;
        implicitFeatureSnap false;
        explicitFeatureSnap true;
        multiRegionFeatureSnap false;
    }

    addLayersControls
    {
        layers
        {

            "boattailStraight.*"
            {
              nSurfaceLayers $prismLayer;
            }


            "bodyTube.*"
            {
              nSurfaceLayers $prismLayer;
            }


            "finCan.*"
            {
              nSurfaceLayers $prismLayer;
            }


            "nosecone.*"
            {
              nSurfaceLayers $prismLayer;
            }


            "nozzle.*"
            {
              nSurfaceLayers $prismLayer;
            }


        }

        relativeSizes true;
        expansionRatio 1.3;
        finalLayerThickness 0.5;
        minThickness 0.001;
        nGrow 0;
        featureAngle 180;
        slipFeatureAngle 80;
        nRelaxIter 5;
        nSmoothSurfaceNormals 1;
        nSmoothNormals 3;
        nSmoothThickness 10;
        maxFaceThicknessRatio 0.5;
        maxThicknessToMedialRatio 0.3;
        minMedialAxisAngle 90;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;
        writeVTK false;
        noErrors false;
        layerRecovery 1;
        growZoneLayers false;
        projectGrownUp 0.0;
    }

    meshQualityControls
    {
        maxNonOrtho 60;
        maxBoundarySkewness 4;
        maxInternalSkewness 4;
        maxConcave 80;
        minFlatness 0.5;
        minVol 1.00E-13;
        minTetQuality -1e30;
        minArea -1;
        minTwist 0.03;
        minDeterminant 0.01;
        minFaceWeight 0.03;
        minVolRatio 0.01;
        minTriangleTwist -1;
        nSmoothScale 4;
        errorReduction 0.75;
        relaxed {maxNonOrtho 60; maxBoundarySkewness 4; }

    }

    debug 0;
    mergeTolerance 1E-6;
    autoBlockMesh false;
