0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{

    "nosecone.*"
    {
        type            zeroGradient;
    }
    "bodyTube.*"
    {
        type            zeroGradient;
    }
    "finCan.*"
    {
        type            zeroGradient;
    }
    "boattailStraight.*"
    {
        type            zeroGradient;
    }
    "nozzle.*"
    {
        type            zeroGradient;
    }
    
    front
    {
        type            fixedValue;
        value           $internalField;
    }
    back
    {
        type            fixedValue;
        value           $internalField;
    }
    top
    {
        type            fixedValue;
        value           $internalField;
    }
    bot
    {
        type            fixedValue;
        value           $internalField;
    }
    left
    {
        type            fixedValue;
        value           $internalField;
    }
    right
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
