0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 6.1e-5;

boundaryField
{
    "nosecone.*"
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    "bodyTube.*"
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    "finCan.*"
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    "boattailStraight.*"
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    "nozzle.*"
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    front
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    back
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    bot
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    left
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    right
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
