system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    default                                             steadyState;
}

gradSchemes
{
    default                                             Gauss linear;
}

divSchemes
{
    default                                             none;
    div(phi,U)                                          Gauss linearUpwindV grad(U);
    div(phi,e)                                          Gauss upwind;
    div((nuEff*dev2(T(grad(U)))))                       Gauss linear;
    div(phi,h)                                          Gauss upwind;
    div(phid,p)                                         Gauss limitedLinear 1.0;
    div(((rho*nuEff)*dev2(T(grad(U)))))                 Gauss linear;
    div(phi,nuTilda)                                    Gauss upwind;
    div(phi,K)                                          Gauss upwind;
    div(phi,Ekp)                                        Gauss upwind;
    div(pc)                                             Gauss upwind;
}

interpolationSchemes
{
    default                                             linear;
}

laplacianSchemes
{
    default                                             Gauss linear corrected;
}

snGradSchemes
{
    default                                             corrected;
}

fluxRequired
{
    default                                             no;
}

wallDist
{
    method                                              meshWave;
}
