system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

SIMPLE
{
    nNonOrthogonalCorrectors           0;
}

solvers
{
    "(p|p_rgh|G)Final"
    {
        relTol                         0;
        nPreSweeps                     0;
        nCellsInCoarsestLevel          10;
        agglomerator                   faceAreaPair;
        maxIter                        500;
        solver                         GAMG;
        tolerance                      1e-06;
        smoother                       GaussSeidel;
        cacheAgglomeration             true;
        mergeLevels                    1;
        nPostSweeps                    2;
    }
    Phi
    {
        relTol                         1e-2;
        maxIter                        50;
        agglomerator                   faceAreaPair;
        nCellsInCoarsestLevel          10;
        solver                         GAMG;
        cacheAgglomeration             true;
        mergeLevels                    1;
        smoother                       DIC;
        tolerance                      1e-6;
    }
    "(U|T|e|h|nuTilda|k|omega|epsilon|ReThetat|gammaInt)Final"
    {
        relTol                         0;
        nSweeps                        1;
        solver                         smoothSolver;
        smoother                       GaussSeidel;
        maxIter                        500;
        tolerance                      1e-06;
    }
    "(U|T|e|h|nuTilda|k|omega|epsilon|ReThetat|gammaInt)"
    {
        relTol                         0.1;
        nSweeps                        1;
        solver                         smoothSolver;
        smoother                       GaussSeidel;
        maxIter                        10;
        tolerance                      1e-20;
    }
    "(p|p_rgh|G)"
    {
        relTol                         0.1;
        nPreSweeps                     0;
        nCellsInCoarsestLevel          10;
        agglomerator                   faceAreaPair;
        maxIter                        10;
        solver                         GAMG;
        tolerance                      1e-20;
        smoother                       GaussSeidel;
        cacheAgglomeration             true;
        mergeLevels                    1;
        nPostSweeps                    2;
    }
}

relaxationFactors
{
    fields
    {
        p                              1.00;
        rho                            1.00;
    }
    equations
    {
        nuTilda                        0.70;
        p                              1.00;
        U                              0.70;
        e                              0.70;
        T                              0.70;
    }

}

potentialFlow
{
    nNonOrthogonalCorrectors           20;
    PhiRefCell                         0;
    PhiRefValue                        0;
}